<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<c:choose>
    <c:when test="${param.type eq 1}">
        {
            "code": 200,
            "message": "success",
            "data": {
            "page": 1,
            "count": 4,
            "total": 8,
            "rows": [
            {
            "id": 1,
            "title": "福利来了出口退税领补贴",
            "auther": "无",
            "url": "平台公告",
            "picturePath": "/",
            "summary": "据市场调查反馈，现在跨境电商大多存在毛利下降，融资难融资贵等问题。针对此情况特推出以下服务产品：出口退税和垫资代采。大家一定会问服务产品有什么优势？操作流程又是如何呢？我要满足什么条件才能够申请呢？那么请大家带着这些问题往下看。",
            "releaseTime": "2017-01-01",
            "type": 1,
            "isHead": 0
            },
            {
            "id": 2,
            "title": "重要：客服QQ服务窗口切换通知",
            "auther": "无",
            "url": "平台公告",
            "picturePath": "/",
            "summary": "鉴于我司企业QQ: 400 996 0766，自2016-07-05试点上线以来，收到的客户反馈良好，我司计划于2016-07-25对企业QQ的功能作升级，届时企业QQ将全面支持海外仓的业务咨询及处理。",
            "releaseTime": "2017-01-02",
            "type": 1,
            "isHead": 0
            }
            ]
            }
        }
    </c:when>
    <c:when test="${param.type eq 2}">
        {
        "code": 200,
        "message": "success",
        "data": {
        "page": 1,
        "count": 3,
        "total": 3,
        "rows": [
        {
        "id": 1,
        "title": "身边的榜样 | 钟娟：在千头万绪中沉淀自我，服务客户",
        "auther": "无",
        "url": "平台动态",
        "picturePath": "/",
        "summary": "做外贸离不开“钱”之一字。货币是商品交换的产物，自古以来，贸易便以钱为媒使得商品流通，从局部到世界，从而拉动了世界经济的发展。而随着时代的发展，一方面是国际经济与贸易制度的愈发完善，一方面是互联网工具在世界经济贸易往来中的广泛应用，中小微外贸企业在享受低门槛做外贸的同时也面临着处理更繁琐的和“钱”有关的那些事儿。从付款方式的选择，到收汇结汇，道道关卡中稍有不慎，就会直接面临经济损失。",
        "releaseTime": "2017-04-12",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 2,
        "title": "新业态需要新人才 江苏跨境担起人才培养新责任",
        "auther": "无",
        "url": "平台动态",
        "picturePath": "/",
        "summary": "2017年4月11日，在江苏省进出口商会的组织下，南京城市职业学院60余名国际贸易专业学生到访江苏跨境电子商务服务有限公司（下称：江苏跨境）参观学习，了解在“互联网+”背景、“一带一路”战略下我国对外贸易进行的转型升级，以及外综服新业态是如何帮助广大中小微外贸实体企业降本增效的。",
        "releaseTime": "2017-04-12",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 3,
        "title": "搭建风控体系 让“外综服”成为诚信标杆",
        "auther": "许雯斐",
        "url": "平台动态",
        "picturePath": "/",
        "summary": "因为‘外综服’企业面对的是庞大的中小微外贸企业，他们的抗风险能力较低，这也是‘外综服’平台的风险所在。外贸圈呼唤诚信“软环境”。“三级风控”把住“生命线”。帮企业找到“风险线”。",
        "releaseTime": "2017-03-15",
        "type": 2,
        "isHead": 0
        }
        ]
        }
        }
    </c:when>
    <c:when test="${param.type eq 3}">
        {
        "code": 200,
        "message": "success",
        "data": {
        "page": 1,
        "count": 3,
        "total": 3,
        "rows": [
        {
        "id": 1,
        "title": "新外贸人向传统外贸淡季说“不”",
        "auther": "许雯斐",
        "url": "行业动态",
        "picturePath": "/",
        "summary": "通常情况下，7、8两个月，欧美国家很多公司开始放假，是外贸圈里众所周知的淡季。询盘少，订单少，本就饱受下行压力的外贸企业在这个时候显得更加冷淡。",
        "releaseTime": "2017-03-30",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 2,
        "title": "10亿“中国造”如何从这里“走出去”",
        "auther": "许雯斐",
        "url": "平台动态",
        "picturePath": "/",
        "summary": "企业规模小，通关效率低；产品想走出国门，却找不到“门”；上百万的货品出口，托给什么样的平台才靠谱……外贸形势低迷，倒逼外贸企业转变思路，而在压力中找机遇并不难，难的是上述问题如何解决。",
        "releaseTime": "2017-03-30",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 3,
        "title": "“轻娱乐+社交化”用快乐连接每一个外贸人",
        "auther": "许雯斐",
        "url": "平台动态",
        "picturePath": "/",
        "summary": "互联网时代的内容营销，让连接用户的成本降低，但这也让“抓住”用户变得前所未有的困难，用户口味千变万化，内容的呈现方式日新月异，只有拥有足够的耐心走进用户群体的话语体系，了解用户真正的需求，才能长久的留住客户。",
        "releaseTime": "2017-03-30",
        "type": 2,
        "isHead": 0
        }
        ]
        }
        }
    </c:when>
    <c:when test="${param.type eq 4}">
        {
        "code": 200,
        "message": "success",
        "data": {
        "page": 1,
        "count": 3,
        "total": 3,
        "rows": [
        {
        "id": 1,
        "title": "外贸综合服务模式与代理模式对比",
        "auther": "无",
        "url": "行业知识库",
        "picturePath": "/",
        "summary": "代理模式在一片“外综热”的形式下，如同小丑，人人避之；即使是代理也硬会把自己公司往外综身上靠，因为这一点都不难，关于外综各种高大上的报道随处可见，学几个光鲜的名词还是很容易的。",
        "releaseTime": "2017-03-07",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 2,
        "title": "外贸单证知识60问，做外贸的请收藏！",
        "auther": "无",
        "url": "行业知识库",
        "picturePath": "/",
        "summary": "1、银行是否接受出具日期早于信用证出具日期的单据，如果接受，前提条件是什么？",
        "releaseTime": "2017-03-17",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 3,
        "title": "外贸综合服务政策汇编",
        "auther": "廖承金",
        "url": "行业知识库",
        "picturePath": "/",
        "summary": "国家对外贸综合服务的重视是毋庸置疑的， 在此从四个方面整理了下外贸综合服务的机会：1. 国发办政策；2. 两会政府工作报告；3. 致公党提案；4. 全国人大代表提案；献给正在外综路上和准备上外综这条大道的各位朋友！  ",
        "releaseTime": "2017-01-03",
        "type": 2,
        "isHead": 0
        }
        ]
        }
        }
    </c:when>
    <c:when test="${param.isHead eq 1}">
        {
        "code": 200,
        "message": "success",
        "data": {
        "page": 1,
        "count": 4,
        "total": 4,
        "rows": [
        {
        "id": 1,
        "title": "福利来了出口退税领补贴",
        "auther": "无",
        "url": "平台公告",
        "picturePath": "",
        "summary": "据市场调查反馈，现在跨境电商大多存在毛利下降，融资难融资贵等问题。针对此情况特推出以下服务产品：出口退税和垫资代采。大家一定会问服务产品有什么优势？操作流程又是如何呢？我要满足什么条件才能够申请呢？那么请大家带着这些问题往下看。",
        "releaseTime": "2017-01-01",
        "type": 1,
        "isHead": 0
        },
        {
        "id": 2,
        "title": "重要：客服QQ服务窗口切换通知",
        "auther": "无",
        "url": "平台公告",
        "picturePath": "",
        "summary": "鉴于我司企业QQ: 400 996 0766，自2016-07-05试点上线以来，收到的客户反馈良好，我司计划于2016-07-25对企业QQ的功能作升级，届时企业QQ将全面支持海外仓的业务咨询及处理。",
        "releaseTime": "2017-01-02",
        "type": 1,
        "isHead": 0
        },
        {
        "id": 1,
        "title": "新外贸人向传统外贸淡季说“不”",
        "auther": "许雯斐",
        "url": "行业动态",
        "picturePath": "",
        "summary": "通常情况下，7、8两个月，欧美国家很多公司开始放假，是外贸圈里众所周知的淡季。询盘少，订单少，本就饱受下行压力的外贸企业在这个时候显得更加冷淡。",
        "releaseTime": "2017-03-30",
        "type": 2,
        "isHead": 0
        },
        {
        "id": 2,
        "title": "10亿“中国造”如何从这里“走出去”",
        "auther": "许雯斐",
        "url": "平台动态",
        "picturePath": "",
        "summary": "企业规模小，通关效率低；产品想走出国门，却找不到“门”；上百万的货品出口，托给什么样的平台才靠谱……外贸形势低迷，倒逼外贸企业转变思路，而在压力中找机遇并不难，难的是上述问题如何解决。",
        "releaseTime": "2017-03-30",
        "type": 2,
        "isHead": 0
        }
        ]
        }
        }
    </c:when>
    <c:otherwise>
        {
        "code": 400,
        "message": "文章不存在",
        "data": [
        {
        }
        ]
        }
    </c:otherwise>
</c:choose>